// 이전, 내용, 다음 + 배경 컴포넌트를 하나로 조합해서 여러 컴포넌트 속에서 사용하기

const Narration = ({step, setStep}) => {

    // 이 시나리오는 밖으로 빼기
    const narrationContent = [{
        step: 0,
        contents: "심심이는 당신의 이름을 알아야해요!",
    },
    {
        step: 1,
        contents: "심심이에게 말을 걸어보세요!",
    },
    {
        step: 2,
        contents: "심심이는 아직 아는 말이 없네요. 심심이에게 말을 가르쳐볼까요?",
    },
    {
        step: 3,
        contents: "심심이에게 말을 가르쳤어요~",
    },
    {
        step: 4,
        contents: "심심이에게 방금 가르친 말을 걸어보세요!",
    },
    {
        step: 5,
        contents: "와! 심심이가 말을 할 줄 알게 되었어요",
    },
    {
        step: 6,
        contents: "심심이에게 말을 더 가르쳐볼까요?",
    },
    {
        step: 7,
        contents: "2개의 말을 추가로 가르쳐주세요.",
    },
    {
        step: 8,
        contents: "심심이가 세 개의 말을 배웠습니다~👏🏻👏🏻👏🏻",
    },
    {
        step: 9,
        contents: "이제 심심이가 어떻게 작동하는지 알아볼까요?",
    },
    {
        step: 10,
        contents: "이곳은 심심이의 머릿속이에요!",
    },
    {
        step: 11,
        contents: "내가 가르친 말들이 잘 학습되어있는게 보이죠?",
    },
    {
        step: 12,
        contents: "이렇게 학습된 말을 누군가가 걸었을 때\n심심이는 배운대로 이야기합니다.",
    },
    {
        step: 13,
        contents: "수 많은 사람들에게 이와 같은 방법으로 말들을 배워서\n말을 잘 할수 있게 되는거에요!",
    },
    {
        step: 14,
        contents: "이제 내가 만든 챗봇을 가족이나 친구들에게 공유해보세요!",
    }]

    const beforeStep = () => {
        if(step-1 < 0){
            alert("이전단계가 없습니다");
            return;
        }
        setStep(step-1);
    }
    const nextStep = () => {
        if(step > narrationContent.length-2){
            alert("다음단계가 없습니다");
            return;
        }
        setStep(step+1);
    }

    return (
        <div className="Narration">
            <div className="before" step={step} onClick={beforeStep}>{"<"} 이전</div>
            <div className="contents">{narrationContent[step].contents}</div>
            <div className="next" step={step} onClick={nextStep}>다음 {">"}</div>
        </div>
    )
};

export default Narration;